---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LightNode
source: html/e94b6bfb-144b-6021-6cd4-cc344b74f761.htm
---
# LightNode Members

Returns an an instance of an Asset object, which contains definitions of the content node.